import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-menu',
  templateUrl: './menu.component.html',
  styleUrls: ['./menu.component.scss']
})
export class MenuComponent implements OnInit {
  appetizer = [
    {
      title: 'Σούπα',
      description: 'Ψαρόσουπα με κεφάλι από φρέσκια σφυρίδα'
    },
    {
      title: 'Κρητική σαλάτα',
      description:
        'Σταμναγκάθι, ρόκα, μαριναρισμένα ξερά σύκα, ψητό απάκι, λιαστή τομάτα, ξύγαλο Σητείας, χαρουποπαξίμαδα, vinaigrette χαρουπόμελου'
    },
    {
      title: 'Ταραμοσαλάτα «Βασίλαινας»',
      description: 'σερβίρεται με αραβικές πίτες'
    },
    {
      title: 'Ταρτάρ Τόνου',
      description:
        'Φρέσκος τόνος με καπνιστή μαγιονέζα, πίκλες σέλερι και μαραθόριζα'
    },
    {
      title: 'Μελωμένο αυγό',
      description: 'Αυγό ποσέ με αφρό πατάτας, φρέσκια τρούφα και απάκι Κρήτης'
    },
    {
      title: 'Γιουβετσάκι γαρίδας',
      description: 'με καπνιστή τομάτα και βασιλικό'
    },
    {
      title: 'Ελληνική σαλάτα',
      description: 'Τοματίνια, Κνωσού, κροκέτα φέτας, κρίταμο, χειροποίητο ψωμί'
    },
    {
      title: 'Χταπόδι καπνιστό',
      description: 'Σαλάτα ρεβίθια, αγιολί πελτέ'
    },
    {
      title: 'Ταρτάρ Φαγκρί',
      description: 'ξινόμηλο, φύκια και σορμπέ πιπεριάς'
    },
    {
      title: 'Καλαμάρι σχάρας',
      description:
        'σαλάτα μαυρομάτικα, μους καπνιστής τσακώνικης μελιτζάνας, μαρμελάδα τομάτας με λουκάνικο Δράμας'
    },
    {
      title: 'Παραδοσιακή πίτα',
      description:
        'με κατσικάκι Βόνιτσας, καυκαλήθρες, τσουκνίδες, φρέσκα αρωματικά και κρέμα γιαουρτιού'
    }
  ];

  mainDish = [
    {
      title: 'Μπακαλιάρος  σε κρούστα',
      description: 'ψητά παντζάρια, κρέμα σκόρδου'
    },
    {
      title: 'Λαυράκι σχάρας καπνιστό',
      description: 'αλμύρα, παντζάρι, ελληνική σαλάτα'
    },
    {
      title: 'Linguini θαλασσινών',
      description:
        'χειροποίητα linguini με κρόκο Κοζάνης, κολοκύθι,  καλαμάρι, γαρίδες και αυγοτάραχο Μεσολογγίου'
    },
    {
      title: 'Μοσχαρίσιο διάφραγμα',
      description: 'πορτσίνι, νιόκι, καπνιστό κρεμμύδι'
    },
    {
      title: 'Ψάρι ημέρας στα κάρβουνα',
      description:
        '“risotto” αγκινάρας, σπαράγγια, αρακάς, χωριάτικο λουκάνικο Δράμας'
    },
    {
      title: 'Φιλέτο τόνου',
      description: 'αβοκάντο, κινόα, φύκια, κόλιανδρος'
    },
    {
      title: 'Picanha από αρνάκι Βόνιτσας',
      description:
        'πικάντικη ρεβυθάδα γάστρας με σπανάκι και γκρεμολάτα μυρωδικών'
    },
    {
      title: 'Ψάρι ημέρας στα κάρβουνα',
      description:
        'Συναγρίδα, Φαγκρί: €75/κιλό – Σφυρίδα: €65/κιλό – Λαβράκι: €60/κιλό'
    }
  ];

  dessert = [
    {
      title: 'Χαλβάς',
      description:
        'με φρούτα του δάσους, crumble από λευκή σοκολάτα, σορμπέ από μύρτιλα, lime και βασιλικό'
    },
    {
      title: 'Φράουλα',
      description:
        'Φρέσκιες φράουλες,  mousse γιαουρτιού, μαρέγκες lime, παγωτό περγαμόντο'
    },
    {
      title: 'Σου',
      description:
        'Tραγανό σουδάκι γεμιστό με κρέμα καφέ, υγρή λευκή σοκολάτα αρωματισμένη με μαχλέπι και μαστίχα, σορμπέ από κακάο και σμέουρο'
    },
    {
      title: 'Σοκολάτα',
      description:
        'μπάλες bitter σοκολάτας, φοντάν, κόκκινα φρούτα και σορμπέ φραμπουάζ'
    }
  ];

  constructor() {}

  ngOnInit() {}
}
